app/controllers/admin_controller.rb

	def index
    @total_users = User.count
---
SELECT COUNT(*) FROM "users"