app/controllers/stocks_controller.rb

INSERT INTO "stocks" ("stock_name", "stock_symbol", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["stock_name", "Google"], ["stock_symbol", "GOOG"], ["created_at", "2015-02-27 10:57:46.377043"], ["updated_at", "2015-02-27 10:57:46.377043"]]
---
  def create
    @stock = Stock.new(stock_params)

    respond_to do |format|
      if @stock.save

UPDATE "stocks" SET "stock_symbol" = ?, "updated_at" = ? WHERE "stocks"."id" = ?  [["stock_symbol", "APPL"], ["updated_at", "2015-03-02 19:07:39.953370"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @stock.update(stock_params)

DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 2]]
---
  def destroy
    @stock.destroy

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_stock
      @stock = Stock.find(params[:id])