app/controllers/users_controller.rb

  def index
      @users = User.order(:user_name)
---
SELECT "users".* FROM "users"  ORDER BY "users"."user_name" ASC

  def create
      @user = User.create(user_params)
---
INSERT INTO "users" ("user_name", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "Shraddha"], ["password", "lala"], ["email", "sbasnyat@brandeis.edu"], ["created_at", "2015-02-27 10:57:02.845000"], ["updated_at", "2015-02-27 10:57:02.845000"]]

  def update
      @user = User.find(params[:id])

    respond_to do |format|
      if @user
        @user.settings(:frequency).time = params[:user][:time]
        @user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "user_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_name", "Shraddha1"], ["password_digest", "$2a$10$VG0.VqGmbpt1VkuKahmUFOIRD.6LnqjK4sjHQf1GtcNeRG7E1A3tO"], ["updated_at", "2015-03-03 02:48:14.775650"], ["id", 2]]